app/controllers/admin/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at", "status", "image") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "123"], ["description", "1"], ["price", 1.0], ["created_at", "2021-04-29 14:23:18.275848"], ["updated_at", "2021-04-29 14:23:18.275848"], ["status", 1], ["image", "123.jpg"]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "product_categories" ("product_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 2], ["category_id", 1], ["created_at", "2021-05-14 08:22:51.820817"], ["updated_at", "2021-05-14 08:22:51.820817"]]
---
  def create
    @product = Product.new(product_params)
    if @product.save
      @category_array = params.dig(:product, :category_ids)
      @category_array.each do |cat|
        @category = Category.find(cat)
        @product.categories << @category

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "product_categories" ("product_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["category_id", 1], ["created_at", "2021-04-29 14:23:55.111383"], ["updated_at", "2021-04-29 14:23:55.111383"]]
---
  def update
    @product = Product.find(params[:id])
    if @product.update(product_params)
      @product.product_categories.destroy_all
      @category_array = params.dig(:product, :category_ids)
      @category_array.each do |cat|
        @category = Category.find(cat)
        @product.categories << @category