app/views/admin/products/edit.html.slim

SELECT "categories".* FROM "categories" INNER JOIN "product_categories" ON "categories"."id" = "product_categories"."category_id" WHERE "product_categories"."product_id" = ?  [["product_id", 1]]
---
    = f.file_field :image
    = f.association :categories, collection: Category.all, as: :check_boxes, include_hidden: false