app/views/admin/products/new.html.slim

    = f.input :status
    = f.association :categories, collection: Category.all, as: :check_boxes, include_hidden: false
---
SELECT "categories".* FROM "categories"