app/views/layouts/application.html.slim

        .navlink = link_to 'Home', products_path
        - Category.all.each do |category|
          .navlink = link_to category.name.capitalize, category_path(category)
---
SELECT "categories".* FROM "categories"